[
  {
    "number": 1,
    "name": "Sparkletoad",
    "category": "Glimmer",
    "type": "Fairy",
    "height": "1'0\"",
    "weight": "12.5 lbs",
    "numberBattled": 45,
    "description": "It hops through meadows, leaving a trail of shimmering dust that is said to bring good luck.",
    "3dModelPrompt": "Generate a 3D model of a small, cute, cartoony toad Pokémon. It should have large, expressive eyes, smooth pastel pink and purple skin with sparkling spots, and a friendly smile. Style: Pokémon-like."
  },
  {
    "number": 2,
    "name": "Boulderbug",
    "category": "Stone Shell",
    "type": "Rock/Bug",
    "height": "2'5\"",
    "weight": "150.8 lbs",
    "numberBattled": 22,
    "description": "Its shell is as hard as granite. It often tucks itself in, resembling a simple rock to avoid predators.",
    "3dModelPrompt": "Generate a 3D model of a cartoony bug Pokémon with a large, round, grey, rock-like shell covering most of its body. Small insect legs and antennae peek out. Eyes should be simple and black. Style: Pokémon-like."
  },
  {
    "number": 3,
    "name": "Voltavix",
    "category": "Static Fox",
    "type": "Electric",
    "height": "2'1\"",
    "weight": "28.3 lbs",
    "numberBattled": 88,
    "description": "Its fur crackles with stored electricity. When agitated, its tail sparks violently.",
    "3dModelPrompt": "Generate a 3D model of a cartoony fox Pokémon. It should have bright yellow fur with black lightning bolt markings, a bushy tail tipped with sparks, pointy ears, and a mischievous expression. Style: Pokémon-like."
  },
  {
    "number": 4,
    "name": "Aquafin",
    "category": "Droplet Fish",
    "type": "Water",
    "height": "1'6\"",
    "weight": "15.1 lbs",
    "numberBattled": 110,
    "description": "Swims in schools, creating mesmerizing patterns with its synchronized movements.",
    "3dModelPrompt": "Generate a 3D model of a simple, cartoony fish Pokémon. Body shaped like a water droplet, translucent blue scales, large round eyes, and small fins. Style: Pokémon-like."
  },
  {
    "number": 5,
    "name": "Floracub",
    "category": "Seedling Bear",
    "type": "Grass",
    "height": "2'9\"",
    "weight": "45.0 lbs",
    "numberBattled": 53,
    "description": "A small sprout grows on its head, which blooms when it's happy. Loves basking in the sun.",
    "3dModelPrompt": "Generate a 3D model of a cute, cartoony bear cub Pokémon. Fur should be green, with leaf-like ears and a small flower sprouting from its head. Give it a gentle, sleepy expression. Style: Pokémon-like."
  },
  {
    "number": 6,
    "name": "Pyrowisp",
    "category": "Ember Spirit",
    "type": "Fire/Ghost",
    "height": "1'1\"",
    "weight": "1.1 lbs",
    "numberBattled": 76,
    "description": "A floating flame with a mischievous consciousness. It's warm to the touch but phases through objects.",
    "3dModelPrompt": "Generate a 3D model of a cartoony, floating wisp Pokémon. It should look like a ball of fire (orange/red) with simple, glowing eyes and a playful, slightly transparent appearance. Style: Pokémon-like."
  },
  {
    "number": 7,
    "name": "Cryoclaw",
    "category": "Ice Crab",
    "type": "Ice/Water",
    "height": "3'4\"",
    "weight": "120.6 lbs",
    "numberBattled": 31,
    "description": "Its pincers are coated in thick ice, capable of freezing anything they grasp.",
    "3dModelPrompt": "Generate a 3D model of a cartoony crab Pokémon. Body should be icy blue, with large pincers covered in jagged, translucent ice shards. Give it sturdy legs and determined eyes. Style: Pokémon-like."
  },
  {
    "number": 8,
    "name": "Aerowing",
    "category": "Sky Glider",
    "type": "Flying",
    "height": "4'2\"",
    "weight": "33.9 lbs",
    "numberBattled": 95,
    "description": "Catches thermal updrafts to soar for hours without flapping its broad, membrane wings.",
    "3dModelPrompt": "Generate a 3D model of a cartoony flying reptile Pokémon, similar to a pterodactyl but cuter. Smooth, light blue skin, large wings with membranes, a small crest on its head, and wide, curious eyes. Style: Pokémon-like."
  },
  {
    "number": 9,
    "name": "Geopede",
    "category": "Earth Mover",
    "type": "Ground/Bug",
    "height": "5'10\"",
    "weight": "210.2 lbs",
    "numberBattled": 19,
    "description": "Burrows through soil at surprising speeds using its many legs, aerating the ground as it goes.",
    "3dModelPrompt": "Generate a 3D model of a large, cartoony centipede Pokémon. Body segmented, brown and earthy tones, with dozens of small legs. Head should have simple mandibles and small, beady eyes. Style: Pokémon-like."
  },
  {
    "number": 10,
    "name": "Psybeam",
    "category": "Mind Wave",
    "type": "Psychic",
    "height": "3'0\"",
    "weight": "40.5 lbs",
    "numberBattled": 68,
    "description": "Communicates through telepathy. The gem on its forehead glows when using psychic power.",
    "3dModelPrompt": "Generate a 3D model of a slender, cartoony humanoid Pokémon. Smooth purple skin, large head with big, black eyes, and a glowing pink gem on its forehead. Floating slightly off the ground. Style: Pokémon-like."
  }
]