[
  {
    "number": 1,
    "name": "Sparkletoad",
    "category": "Glimmer",
    "type": "Fairy",
    "height": "1'0\"",
    "weight": "12.5 lbs",
    "numberBattled": 45,
    "description": "It hops through meadows, leaving a trail of shimmering dust that is said to bring good luck.",
    "3dModelPrompt": "Generate a 3D model of a small, cute, cartoony toad Pokémon. It should have large, expressive eyes, smooth pastel pink and purple skin with sparkling spots, and a friendly smile. Style: Pokémon-like."
  },
  {
    "number": 2,
    "name": "Boulderbug",
    "category": "Stone Shell",
    "type": "Rock/Bug",
    "height": "2'5\"",
    "weight": "150.8 lbs",
    "numberBattled": 22,
    "description": "Its shell is as hard as granite. It often tucks itself in, resembling a simple rock to avoid predators.",
    "3dModelPrompt": "Generate a 3D model of a cartoony bug Pokémon with a large, round, grey, rock-like shell covering most of its body. Small insect legs and antennae peek out. Eyes should be simple and black. Style: Pokémon-like."
  },
  {
    "number": 3,
    "name": "Voltavix",
    "category": "Static Fox",
    "type": "Electric",
    "height": "2'1\"",
    "weight": "28.3 lbs",
    "numberBattled": 88,
    "description": "Its fur crackles with stored electricity. When agitated, its tail sparks violently.",
    "3dModelPrompt": "Generate a 3D model of a cartoony fox Pokémon. It should have bright yellow fur with black lightning bolt markings, a bushy tail tipped with sparks, pointy ears, and a mischievous expression. Style: Pokémon-like."
  },
  {
    "number": 4,
    "name": "Aquafin",
    "category": "Droplet Fish",
    "type": "Water",
    "height": "1'6\"",
    "weight": "15.1 lbs",
    "numberBattled": 110,
    "description": "Swims in schools, creating mesmerizing patterns with its synchronized movements.",
    "3dModelPrompt": "Generate a 3D model of a simple, cartoony fish Pokémon. Body shaped like a water droplet, translucent blue scales, large round eyes, and small fins. Style: Pokémon-like."
  },
  {
    "number": 5,
    "name": "Floracub",
    "category": "Seedling Bear",
    "type": "Grass",
    "height": "2'9\"",
    "weight": "45.0 lbs",
    "numberBattled": 53,
    "description": "A small sprout grows on its head, which blooms when it's happy. Loves basking in the sun.",
    "3dModelPrompt": "Generate a 3D model of a cute, cartoony bear cub Pokémon. Fur should be green, with leaf-like ears and a small flower sprouting from its head. Give it a gentle, sleepy expression. Style: Pokémon-like."
  },
  {
    "number": 6,
    "name": "Pyrowisp",
    "category": "Ember Spirit",
    "type": "Fire/Ghost",
    "height": "1'1\"",
    "weight": "1.1 lbs",
    "numberBattled": 76,
    "description": "A floating flame with a mischievous consciousness. It's warm to the touch but phases through objects.",
    "3dModelPrompt": "Generate a 3D model of a cartoony, floating wisp Pokémon. It should look like a ball of fire (orange/red) with simple, glowing eyes and a playful, slightly transparent appearance. Style: Pokémon-like."
  },
  {
    "number": 7,
    "name": "Cryoclaw",
    "category": "Ice Crab",
    "type": "Ice/Water",
    "height": "3'4\"",
    "weight": "120.6 lbs",
    "numberBattled": 31,
    "description": "Its pincers are coated in thick ice, capable of freezing anything they grasp.",
    "3dModelPrompt": "Generate a 3D model of a cartoony crab Pokémon. Body should be icy blue, with large pincers covered in jagged, translucent ice shards. Give it sturdy legs and determined eyes. Style: Pokémon-like."
  },
  {
    "number": 8,
    "name": "Aerowing",
    "category": "Sky Glider",
    "type": "Flying",
    "height": "4'2\"",
    "weight": "33.9 lbs",
    "numberBattled": 95,
    "description": "Catches thermal updrafts to soar for hours without flapping its broad, membrane wings.",
    "3dModelPrompt": "Generate a 3D model of a cartoony flying reptile Pokémon, similar to a pterodactyl but cuter. Smooth, light blue skin, large wings with membranes, a small crest on its head, and wide, curious eyes. Style: Pokémon-like."
  },
  {
    "number": 9,
    "name": "Geopede",
    "category": "Earth Mover",
    "type": "Ground/Bug",
    "height": "5'10\"",
    "weight": "210.2 lbs",
    "numberBattled": 19,
    "description": "Burrows through soil at surprising speeds using its many legs, aerating the ground as it goes.",
    "3dModelPrompt": "Generate a 3D model of a large, cartoony centipede Pokémon. Body segmented, brown and earthy tones, with dozens of small legs. Head should have simple mandibles and small, beady eyes. Style: Pokémon-like."
  },
  {
    "number": 10,
    "name": "Psybeam",
    "category": "Mind Wave",
    "type": "Psychic",
    "height": "3'0\"",
    "weight": "40.5 lbs",
    "numberBattled": 68,
    "description": "Communicates through telepathy. The gem on its forehead glows when using psychic power.",
    "3dModelPrompt": "Generate a 3D model of a slender, cartoony humanoid Pokémon. Smooth purple skin, large head with big, black eyes, and a glowing pink gem on its forehead. Floating slightly off the ground. Style: Pokémon-like."
  },
  {
    "number": 11,
    "name": "Noctula",
    "category": "Shadow Bat",
    "type": "Dark/Flying",
    "height": "2'8\"",
    "weight": "25.7 lbs",
    "numberBattled": 81,
    "description": "Active only at night. Its ultrasonic cries can disorient foes in total darkness.",
    "3dModelPrompt": "Generate a 3D model of a cartoony bat Pokémon. Dark grey or black fur, large leathery wings, prominent ears, and small, glowing red eyes. Slightly menacing but still cute. Style: Pokémon-like."
  },
  {
    "number": 12,
    "name": "Metapod",
    "category": "Iron Shell",
    "type": "Steel",
    "height": "3'6\"",
    "weight": "350.0 lbs",
    "numberBattled": 15,
    "description": "Its body is encased in hardened steel. It moves slowly but is incredibly resistant to attacks.",
    "3dModelPrompt": "Generate a 3D model of a cartoony, pod-like Pokémon made of smooth, grey metallic plates. Simple design, perhaps with glowing blue lines between plates and basic eye slits. Style: Pokémon-like."
  },
  {
    "number": 13,
    "name": "Venospike",
    "category": "Toxic Quill",
    "type": "Poison",
    "height": "1'9\"",
    "weight": "22.1 lbs",
    "numberBattled": 59,
    "description": "The quills covering its body inject a mild toxin upon contact. It curls up when threatened.",
    "3dModelPrompt": "Generate a 3D model of a small, round, cartoony hedgehog-like Pokémon. Body covered in sharp, purple quills with green tips. Small snout, beady eyes, and short legs. Style: Pokémon-like."
  },
  {
    "number": 14,
    "name": "Dracoflame",
    "category": "Tiny Dragon",
    "type": "Dragon/Fire",
    "height": "3'1\"",
    "weight": "55.6 lbs",
    "numberBattled": 41,
    "description": "Though small, it can breathe impressive plumes of fire. It's known for its proud nature.",
    "3dModelPrompt": "Generate a 3D model of a small, cute, cartoony dragon Pokémon. Red scales, small wings, a long tail with a flame tip, stubby arms and legs, and big, slightly arrogant eyes. Style: Pokémon-like."
  },
  {
    "number": 15,
    "name": "Normie",
    "category": "Plain",
    "type": "Normal",
    "height": "2'0\"",
    "weight": "30.0 lbs",
    "numberBattled": 150,
    "description": "An incredibly common creature, often found near towns. It's adaptable but not specialized.",
    "3dModelPrompt": "Generate a 3D model of a very simple, unassuming, cartoony mammal Pokémon. Round body, beige fur, simple ears, dot eyes, and a small tail. Looks very generic and plain. Style: Pokémon-like."
  },
  {
    "number": 16,
    "name": "Mossling",
    "category": "Spore",
    "type": "Grass/Poison",
    "height": "0'10\"",
    "weight": "5.3 lbs",
    "numberBattled": 63,
    "description": "Resembles a clump of moss. Releases paralyzing spores when disturbed.",
    "3dModelPrompt": "Generate a 3D model of a small, round, cartoony Pokémon resembling a clump of green moss. Two small, black eyes peeking out. Texture should look soft and mossy. Style: Pokémon-like."
  },
  {
    "number": 17,
    "name": "Shimmerwing",
    "category": "Glimmer Moth",
    "type": "Bug/Fairy",
    "height": "2'4\"",
    "weight": "8.8 lbs",
    "numberBattled": 71,
    "description": "Its wings scatter iridescent scales that cause drowsiness. Attracted to bright lights.",
    "3dModelPrompt": "Generate a 3D model of a beautiful, cartoony moth Pokémon. Large, intricate wings with shimmering, iridescent patterns (pinks, blues, purples). Fluffy antennae and big, gentle eyes. Style: Pokémon-like."
  },
  {
    "number": 18,
    "name": "Magmacore",
    "category": "Lava Rock",
    "type": "Fire/Rock",
    "height": "4'0\"",
    "weight": "450.9 lbs",
    "numberBattled": 28,
    "description": "Its rocky exterior hides a molten core. Heat radiates intensely from its body.",
    "3dModelPrompt": "Generate a 3D model of a bulky, cartoony rock Pokémon. Dark, craggy rock exterior with glowing orange/red cracks revealing magma underneath. Simple, rugged features. Style: Pokémon-like."
  },
  {
    "number": 19,
    "name": "Zapfin",
    "category": "Electric Eel",
    "type": "Water/Electric",
    "height": "5'1\"",
    "weight": "42.0 lbs",
    "numberBattled": 85,
    "description": "Navigates murky waters using electrical pulses. Can discharge a powerful shock.",
    "3dModelPrompt": "Generate a 3D model of a long, slender, cartoony eel Pokémon. Blue and yellow striped body, small fins, wide mouth, and eyes that spark slightly. Style: Pokémon-like."
  },
  {
    "number": 20,
    "name": "Gusty",
    "category": "Zephyr",
    "type": "Flying/Normal",
    "height": "1'5\"",
    "weight": "3.1 lbs",
    "numberBattled": 120,
    "description": "A small bird Pokémon that creates tiny whirlwinds with its rapid wing beats.",
    "3dModelPrompt": "Generate a 3D model of a small, fluffy, cartoony bird Pokémon. White and light blue feathers, small beak, round body, and constantly looking windswept. Style: Pokémon-like."
  },
  {
    "number": 21,
    "name": "Mudskip",
    "category": "Mud Fish",
    "type": "Water/Ground",
    "height": "1'8\"",
    "weight": "25.5 lbs",
    "numberBattled": 55,
    "description": "Can survive out of water for short periods, using its fins to 'skip' across muddy terrain.",
    "3dModelPrompt": "Generate a 3D model of a cartoony mudskipper Pokémon. Brown, muddy texture, bulging eyes on top of its head, strong pectoral fins used like legs. Looks slightly goofy. Style: Pokémon-like."
  },
  {
    "number": 22,
    "name": "Spectrel",
    "category": "Lingering",
    "type": "Ghost",
    "height": "3'9\"",
    "weight": "0.5 lbs",
    "numberBattled": 66,
    "description": "A sorrowful spirit bound to a location. Its chilling presence can be felt before it's seen.",
    "3dModelPrompt": "Generate a 3D model of a cartoony ghost Pokémon. Wispy, translucent white/grey form, vaguely humanoid shape, with sad, empty eyes and a trailing lower body. Style: Pokémon-like."
  },
  {
    "number": 23,
    "name": "Ironjaw",
    "category": "Steel Trap",
    "type": "Steel/Dark",
    "height": "2'11\"",
    "weight": "190.3 lbs",
    "numberBattled": 39,
    "description": "Its powerful jaws are made of hardened steel and can bite through thick metal.",
    "3dModelPrompt": "Generate a 3D model of a cartoony Pokémon resembling a walking bear trap. Metallic grey body, large jagged jaws forming its 'head', sturdy legs, and menacing red eyes. Style: Pokémon-like."
  },
  {
    "number": 24,
    "name": "Petalite",
    "category": "Flower Stone",
    "type": "Rock/Fairy",
    "height": "1'3\"",
    "weight": "35.7 lbs",
    "numberBattled": 48,
    "description": "Looks like a geode, but opens up to reveal beautiful, crystal-like flower petals inside.",
    "3dModelPrompt": "Generate a 3D model of a small, round, cartoony rock Pokémon. Grey, geode-like exterior that is cracked open, revealing glowing pink crystal 'petals' inside. Simple, shy eyes visible within. Style: Pokémon-like."
  },
  {
    "number": 25,
    "name": "Toximoth",
    "category": "Poison Scale",
    "type": "Bug/Poison",
    "height": "3'5\"",
    "weight": "18.2 lbs",
    "numberBattled": 51,
    "description": "The scales shed from its wings are highly toxic and irritating to the skin and eyes.",
    "3dModelPrompt": "Generate a 3D model of a cartoony moth Pokémon. Wings have dark purple and sickly green patterns. Body is fuzzy and dark. Large compound eyes and feathery antennae. Style: Pokémon-like."
  },
  {
    "number": 26,
    "name": "Mindmeld",
    "category": "Telekine",
    "type": "Psychic",
    "height": "4'1\"",
    "weight": "60.0 lbs",
    "numberBattled": 73,
    "description": "Capable of linking minds with others. Often seen meditating, floating just above the ground.",
    "3dModelPrompt": "Generate a 3D model of a serene, cartoony humanoid Pokémon. Floating in a meditative pose, large head, closed eyes, perhaps multiple arms. Glowing aura, primarily lavender and silver. Style: Pokémon-like."
  },
  {
    "number": 27,
    "name": "Chillby",
    "category": "Snowflake",
    "type": "Ice",
    "height": "0'9\"",
    "weight": "4.9 lbs",
    "numberBattled": 99,
    "description": "A tiny creature formed from ice crystals. Melts easily in warm temperatures.",
    "3dModelPrompt": "Generate a 3D model of a tiny, cute, cartoony Pokémon resembling a snowflake or ice crystal. Translucent light blue body, simple dot eyes, perhaps floating. Style: Pokémon-like."
  },
  {
    "number": 28,
    "name": "Dracotide",
    "category": "Sea Serpent",
    "type": "Water/Dragon",
    "height": "12'6\"",
    "weight": "450.5 lbs",
    "numberBattled": 12,
    "description": "A majestic sea dragon that commands the tides. Rarely seen by humans.",
    "3dModelPrompt": "Generate a 3D model of a large, serpentine, cartoony sea dragon Pokémon. Blue and green scales, fins along its back, majestic head with small horns, powerful tail. Style: Pokémon-like."
  },
  {
    "number": 29,
    "name": "Scrabble",
    "category": "Digging",
    "type": "Normal/Ground",
    "height": "1'10\"",
    "weight": "33.3 lbs",
    "numberBattled": 130,
    "description": "Uses its sturdy claws to dig burrows and search for roots and tubers to eat.",
    "3dModelPrompt": "Generate a 3D model of a cartoony badger-like Pokémon. Brown and white fur, short legs, long claws on its front paws, small ears, and a determined expression. Style: Pokémon-like."
  },
  {
    "number": 30,
    "name": "Gloomfang",
    "category": "Shadow Beast",
    "type": "Dark",
    "height": "4'8\"",
    "weight": "110.8 lbs",
    "numberBattled": 44,
    "description": "Hunts in darkness, using its sharp fangs. Its growl can instill deep fear.",
    "3dModelPrompt": "Generate a 3D model of a shadowy, wolf-like, cartoony Pokémon. Dark purple or black fur, glowing yellow eyes, sharp fangs visible, slightly hunched posture. Style: Pokémon-like."
  },
  {
    "number": 31,
    "name": "Thornvine",
    "category": "Creeping Plant",
    "type": "Grass",
    "height": "6'0\" (length)",
    "weight": "75.2 lbs",
    "numberBattled": 58,
    "description": "A sentient vine covered in sharp thorns. It can move surprisingly quickly across the ground.",
    "3dModelPrompt": "Generate a 3D model of a long, green, thorny vine Pokémon. Should look like a living vine with a simple 'head' at one end (perhaps two leaf 'eyes'). Cartoony style. Style: Pokémon-like."
  },
  {
    "number": 32,
    "name": "Infernoat",
    "category": "Blaze Goat",
    "type": "Fire",
    "height": "4'5\"",
    "weight": "130.1 lbs",
    "numberBattled": 61,
    "description": "Flames perpetually burn at the tips of its horns and hooves. Known for its stubbornness.",
    "3dModelPrompt": "Generate a 3D model of a cartoony goat Pokémon. Reddish-brown fur, large curved horns with flames at the tips, hooves also ending in flames. Proud stance. Style: Pokémon-like."
  },
  {
    "number": 33,
    "name": "Aquabub",
    "category": "Bubble Frog",
    "type": "Water",
    "height": "1'2\"",
    "weight": "10.3 lbs",
    "numberBattled": 105,
    "description": "Creates bubbles from the sacs on its cheeks that can trap small objects or refract light.",
    "3dModelPrompt": "Generate a 3D model of a small, cute, cartoony frog Pokémon. Blue skin, large yellow sacs on its cheeks, webbed feet, and big, innocent eyes. Style: Pokémon-like."
  },
  {
    "number": 34,
    "name": "Sparkitten",
    "category": "Static Cat",
    "type": "Electric",
    "height": "1'4\"",
    "weight": "9.9 lbs",
    "numberBattled": 92,
    "description": "Its fur generates static electricity when petted. Playfully shocks its trainer.",
    "3dModelPrompt": "Generate a 3D model of a cute, cartoony kitten Pokémon. Yellow fur with brown stripes, pointy ears, long tail with a spark shape at the end. Playful expression. Style: Pokémon-like."
  },
  {
    "number": 35,
    "name": "Nimblitz",
    "category": "Speed",
    "type": "Normal",
    "height": "3'3\"",
    "weight": "40.1 lbs",
    "numberBattled": 145,
    "description": "Known for its incredible speed and agility, often appearing as just a blur.",
    "3dModelPrompt": "Generate a 3D model of a sleek, fast-looking, cartoony mammal Pokémon, perhaps resembling a weasel or mongoose. Streamlined body, light brown fur, focused expression. Style: Pokémon-like."
  },
  {
    "number": 36,
    "name": "Pixiedust",
    "category": "Sprite",
    "type": "Fairy",
    "height": "0'8\"",
    "weight": "1.5 lbs",
    "numberBattled": 78,
    "description": "A tiny, winged creature that flits about, leaving trails of sparkling dust.",
    "3dModelPrompt": "Generate a 3D model of a tiny, cartoony humanoid fairy Pokémon. Small body, large head, translucent wings, perhaps green leafy clothing. Big curious eyes. Style: Pokémon-like."
  },
  {
    "number": 37,
    "name": "Rockslide",
    "category": "Avalanche",
    "type": "Rock",
    "height": "5'9\"",
    "weight": "700.0 lbs",
    "numberBattled": 25,
    "description": "It resembles a pile of boulders. When it moves, it causes the ground to shake.",
    "3dModelPrompt": "Generate a 3D model of a large, imposing, cartoony Pokémon made of stacked boulders. Rough texture, simple limbs formed from rocks, glowing eyes deep within. Style: Pokémon-like."
  },
  {
    "number": 38,
    "name": "Phantasma",
    "category": "Illusion",
    "type": "Ghost/Psychic",
    "height": "4'6\"",
    "weight": "2.0 lbs",
    "numberBattled": 69,
    "description": "Creates illusions to confuse its opponents. Its true form is rarely seen.",
    "3dModelPrompt": "Generate a 3D model of a mysterious, cartoony ghost Pokémon. Semi-transparent, shifting form, perhaps with mask-like features and swirling patterns. Purple and black colors. Style: Pokémon-like."
  },
  {
    "number": 39,
    "name": "Steeleaf",
    "category": "Blade Grass",
    "type": "Grass/Steel",
    "height": "3'10\"",
    "weight": "140.6 lbs",
    "numberBattled": 43,
    "description": "The leaves on its body are razor-sharp and metallic. It can launch them as projectiles.",
    "3dModelPrompt": "Generate a 3D model of a cartoony plant-like Pokémon. Body made of green stalks, but with sharp, metallic silver leaves. Perhaps looks like a walking bush with sharp edges. Style: Pokémon-like."
  },
  {
    "number": 40,
    "name": "Squirmle",
    "category": "Worm",
    "type": "Bug",
    "height": "1'0\"",
    "weight": "3.2 lbs",
    "numberBattled": 115,
    "description": "A common sight in forests and gardens. It evolves into stronger forms.",
    "3dModelPrompt": "Generate a 3D model of a simple, cute, cartoony worm Pokémon. Segmented green body, big round eyes, maybe small antennae. Looks harmless and basic. Style: Pokémon-like."
  },
  {
    "number": 41,
    "name": "Dusklurk",
    "category": "Ambush",
    "type": "Dark/Ground",
    "height": "3'7\"",
    "weight": "95.4 lbs",
    "numberBattled": 37,
    "description": "Buries itself just below the surface, waiting to ambush unsuspecting prey or travelers.",
    "3dModelPrompt": "Generate a 3D model of a cartoony predator Pokémon. Low-slung body, dark brown/black colors, perhaps only large, glowing eyes visible above ground level. Sharp claws hinted at. Style: Pokémon-like."
  },
  {
    "number": 42,
    "name": "Blizzara",
    "category": "Snow Spirit",
    "type": "Ice/Ghost",
    "height": "5'0\"",
    "weight": "5.5 lbs",
    "numberBattled": 52,
    "description": "Said to be the spirit of a blizzard. Appears during heavy snowfall, chilling the air around it.",
    "3dModelPrompt": "Generate a 3D model of an ethereal, cartoony spirit Pokémon. Flowing, translucent white and blue form, resembling wind-blown snow. Vague feminine shape, sorrowful eyes. Style: Pokémon-like."
  },
  {
    "number": 43,
    "name": "Corrodo",
    "category": "Acidic",
    "type": "Poison/Steel",
    "height": "2'6\"",
    "weight": "160.8 lbs",
    "numberBattled": 33,
    "description": "Its metallic body secretes a powerful acid that can dissolve almost anything.",
    "3dModelPrompt": "Generate a 3D model of a cartoony robot-like Pokémon. Dull, corroded metal body (greens, browns on grey), perhaps dripping acid from joints. Simple design, maybe tank treads. Style: Pokémon-like."
  },
  {
    "number": 44,
    "name": "Wyvernal",
    "category": "Sky Fury",
    "type": "Dragon/Flying",
    "height": "7'2\"",
    "weight": "280.3 lbs",
    "numberBattled": 29,
    "description": "A fierce dragon with powerful wings and a venomous tail barb. Rules the skies.",
    "3dModelPrompt": "Generate a 3D model of a cartoony wyvern Pokémon (two legs, two wings). Green scales, large wings, sharp claws, fierce expression, barbed tail. Style: Pokémon-like."
  },
  {
    "number": 45,
    "name": "Cuddlefluff",
    "category": "Soft",
    "type": "Normal/Fairy",
    "height": "1'9\"",
    "weight": "14.7 lbs",
    "numberBattled": 135,
    "description": "Incredibly soft and fluffy. Loves to be hugged, radiating a calming aura.",
    "3dModelPrompt": "Generate a 3D model of an extremely fluffy, round, cartoony Pokémon. Pastel pink fur, big gentle eyes, small paws barely visible under the fluff. Looks incredibly soft and huggable. Style: Pokémon-like."
  },
  {
    "number": 46,
    "name": "Bloomare",
    "category": "Flower Horse",
    "type": "Grass/Fairy",
    "height": "5'3\"",
    "weight": "190.0 lbs",
    "numberBattled": 47,
    "description": "Flowers bloom in its mane and tail. It gallops through fields, spreading pollen.",
    "3dModelPrompt": "Generate a 3D model of a graceful, cartoony horse Pokémon. White body, mane and tail made of green leaves and colorful flowers. Gentle expression. Style: Pokémon-like."
  },
  {
    "number": 47,
    "name": "Searpent",
    "category": "Heat Snake",
    "type": "Fire/Poison",
    "height": "8'1\"",
    "weight": "90.6 lbs",
    "numberBattled": 56,
    "description": "Its scales radiate intense heat, and its fangs deliver a burning toxin.",
    "3dModelPrompt": "Generate a 3D model of a cartoony snake Pokémon. Red and orange scales with some purple markings. Forked tongue, menacing eyes, perhaps small heat vents along its body. Style: Pokémon-like."
  },
  {
    "number": 48,
    "name": "Geyserup",
    "category": "Hot Spring",
    "type": "Water/Fire",
    "height": "4'11\"",
    "weight": "230.4 lbs",
    "numberBattled": 36,
    "description": "Stores geothermally heated water inside its body, which it can spray with great force.",
    "3dModelPrompt": "Generate a 3D model of a bulky, turtle-like, cartoony Pokémon. Shell resembles a rock with steam vents. Body is blue, head has a nozzle-like mouth. Style: Pokémon-like."
  },
  {
    "number": 49,
    "name": "Plasmoid",
    "category": "Plasma",
    "type": "Electric/Ghost",
    "height": "2'2\"",
    "weight": "0.8 lbs",
    "numberBattled": 79,
    "description": "A being of pure electrical plasma, able to phase through walls and deliver shocks.",
    "3dModelPrompt": "Generate a 3D model of an amorphous, cartoony plasma Pokémon. Glowing, crackling yellow/blue energy form, vaguely spherical with simple eyes. Semi-transparent. Style: Pokémon-like."
  },
  {
    "number": 50,
    "name": "Aviatweet",
    "category": "Songbird",
    "type": "Normal/Flying",
    "height": "0'11\"",
    "weight": "2.1 lbs",
    "numberBattled": 140,
    "description": "Its cheerful singing can be heard throughout the forest. It mimics sounds it hears.",
    "3dModelPrompt": "Generate a 3D model of a small, cute, cartoony songbird Pokémon. Brightly colored feathers (e.g., blue and yellow), small beak, large curious eyes. Perched on a branch. Style: Pokémon-like."
  },
  {
    "number": 51,
    "name": "Quakeboar",
    "category": "Tremor Pig",
    "type": "Ground",
    "height": "4'7\"",
    "weight": "380.7 lbs",
    "numberBattled": 34,
    "description": "Its powerful charges can cause localized tremors. It has tough, earth-colored hide.",
    "3dModelPrompt": "Generate a 3D model of a large, powerful, cartoony boar Pokémon. Brown, tough-looking hide, large tusks, small angry eyes, sturdy legs. Looks ready to charge. Style: Pokémon-like."
  },
  {
    "number": 52,
    "name": "Enigmind",
    "category": "Puzzle",
    "type": "Psychic/Steel",
    "height": "3'5\"",
    "weight": "210.9 lbs",
    "numberBattled": 50,
    "description": "Its metallic body is covered in strange symbols. It communicates through riddles.",
    "3dModelPrompt": "Generate a 3D model of a strange, cartoony Pokémon resembling a Rubik's cube or puzzle box with limbs. Metallic surface with glowing, shifting symbols. Perhaps floating. Style: Pokémon-like."
  },
  {
    "number": 53,
    "name": "Grimshade",
    "category": "Nightmare",
    "type": "Dark/Ghost",
    "height": "5'2\"",
    "weight": "1.8 lbs",
    "numberBattled": 49,
    "description": "Said to embody nightmares. Those who encounter it experience intense fear and see illusions.",
    "3dModelPrompt": "Generate a 3D model of a terrifying yet cartoony ghost Pokémon. Dark, shadowy form, perhaps with a skull-like face, tattered cloak appearance, and menacing, glowing red eyes. Style: Pokémon-like."
  },
  {
    "number": 54,
    "name": "Chitinel",
    "category": "Armor Bug",
    "type": "Bug/Steel",
    "height": "4'3\"",
    "weight": "250.1 lbs",
    "numberBattled": 38,
    "description": "Covered in layered plates of metallic chitin, providing excellent defense.",
    "3dModelPrompt": "Generate a 3D model of a large, armored, cartoony insect Pokémon. Shiny, metallic exoskeleton (gunmetal grey), multiple limbs, compound eyes, perhaps large mandibles. Style: Pokémon-like."
  },
  {
    "number": 55,
    "name": "Frostfang",
    "category": "Ice Wolf",
    "type": "Ice",
    "height": "4'9\"",
    "weight": "135.3 lbs",
    "numberBattled": 54,
    "description": "Hunts in snowy mountains. Its breath is freezing cold, and its fangs are like icicles.",
    "3dModelPrompt": "Generate a 3D model of a majestic, cartoony wolf Pokémon. White and light blue fur, sharp ice-like fangs visible, piercing blue eyes, bushy tail. Style: Pokémon-like."
  },
  {
    "number": 56,
    "name": "Venomurk",
    "category": "Swamp Gas",
    "type": "Poison/Water",
    "height": "3'1\"",
    "weight": "44.4 lbs",
    "numberBattled": 60,
    "description": "Inhabits murky swamps, releasing poisonous bubbles from the water's surface.",
    "3dModelPrompt": "Generate a 3D model of an amphibious, cartoony Pokémon. Dark green and purple slimy skin, bulbous eyes, perhaps releasing purple gas bubbles. Lurking posture. Style: Pokémon-like."
  },
  {
    "number": 57,
    "name": "Dracostar",
    "category": "Cosmic Dragon",
    "type": "Dragon/Psychic",
    "height": "9'5\"",
    "weight": "310.6 lbs",
    "numberBattled": 18,
    "description": "Said to have come from space. Its scales shimmer like a nebula, and it wields cosmic power.",
    "3dModelPrompt": "Generate a 3D model of a wise, ancient-looking, cartoony dragon Pokémon. Dark blue/purple scales with sparkling 'star' patterns. Perhaps has galaxy patterns on its wings. Serene, powerful look. Style: Pokémon-like."
  },
  {
    "number": 58,
    "name": "Bounciball",
    "category": "Rubber",
    "type": "Normal",
    "height": "2'3\"",
    "weight": "20.2 lbs",
    "numberBattled": 125,
    "description": "Its body is extremely elastic and bouncy. It travels by bouncing great distances.",
    "3dModelPrompt": "Generate a 3D model of a simple, round, cartoony Pokémon that looks like a rubber ball. Bright primary color (e.g., red), simple face, perhaps small stubby limbs. Style: Pokémon-like."
  },
  {
    "number": 59,
    "name": "Guardia",
    "category": "Guardian",
    "type": "Steel/Fighting",
    "height": "6'1\"",
    "weight": "400.0 lbs",
    "numberBattled": 26,
    "description": "A knight-like Pokémon dedicated to protecting others. Wields its arm blades with skill.",
    "3dModelPrompt": "Generate a 3D model of a humanoid, knight-like, cartoony Pokémon. Metallic armor body (silver/gold), perhaps a shield on one arm and a blade on the other. Determined expression. Style: Pokémon-like."
  },
  {
    "number": 60,
    "name": "Nectarat",
    "category": "Sweet Scent",
    "type": "Grass/Bug",
    "height": "1'1\"",
    "weight": "4.1 lbs",
    "numberBattled": 102,
    "description": "This small creature feeds on flower nectar and emits a sweet, alluring fragrance.",
    "3dModelPrompt": "Generate a 3D model of a tiny, cute, cartoony insect Pokémon. Resembles a bee or aphid, green and pink colors, perhaps with flower petals incorporated into its design. Big eyes. Style: Pokémon-like."
  },
  {
    "number": 61,
    "name": "Pyreling",
    "category": "Ash",
    "type": "Fire/Dark",
    "height": "2'10\"",
    "weight": "38.9 lbs",
    "numberBattled": 57,
    "description": "Born from embers and ash. It drains heat from its surroundings, leaving areas cold.",
    "3dModelPrompt": "Generate a 3D model of a small, impish, cartoony Pokémon. Body looks like smoldering ash (dark grey with red embers), sharp features, mischievous glowing eyes. Style: Pokémon-like."
  },
  {
    "number": 62,
    "name": "Tidalwave",
    "category": "Surf",
    "type": "Water",
    "height": "5'5\"",
    "weight": "215.7 lbs",
    "numberBattled": 70,
    "description": "Can create massive waves by manipulating water currents. Popular among surfers.",
    "3dModelPrompt": "Generate a 3D model of a powerful, aquatic, cartoony Pokémon. Perhaps resembles a dolphin or seal with wave patterns on its blue body. Strong tail fin. Looks energetic. Style: Pokémon-like."
  },
  {
    "number": 63,
    "name": "Zappillar",
    "category": "Static Worm",
    "type": "Bug/Electric",
    "height": "1'5\"",
    "weight": "7.3 lbs",
    "numberBattled": 96,
    "description": "Its body stores electricity. Touching its fuzzy spines results in a nasty shock.",
    "3dModelPrompt": "Generate a 3D model of a fuzzy, cartoony caterpillar Pokémon. Yellow and black segments, small antennae that spark, multiple legs. Looks slightly hazardous. Style: Pokémon-like."
  },
  {
    "number": 64,
    "name": "Zephyrion",
    "category": "Sky Lord",
    "type": "Flying/Fairy",
    "height": "6'8\"",
    "weight": "150.2 lbs",
    "numberBattled": 30,
    "description": "A majestic creature that rides the winds. Its feathers shimmer with faint light.",
    "3dModelPrompt": "Generate a 3D model of a large, majestic, cartoony bird Pokémon, perhaps resembling a griffin or large eagle. White and gold feathers, powerful wings, noble expression. Style: Pokémon-like."
  },
  {
    "number": 65,
    "name": "Terraform",
    "category": "Clay",
    "type": "Ground/Psychic",
    "height": "3'8\"",
    "weight": "180.0 lbs",
    "numberBattled": 46,
    "description": "Can mold its clay-like body into various shapes using psychic power.",
    "3dModelPrompt": "Generate a 3D model of a cartoony Pokémon made of wet clay or mud. Simple, malleable form, perhaps with visible fingerprints. Eyes are simple indentations. Brown color. Style: Pokémon-like."
  },
  {
    "number": 66,
    "name": "Ectoplasm",
    "category": "Slime Ghost",
    "type": "Ghost/Poison",
    "height": "2'9\"",
    "weight": "25.1 lbs",
    "numberBattled": 64,
    "description": "A slimy, amorphous ghost that leaves trails of toxic ectoplasm.",
    "3dModelPrompt": "Generate a 3D model of a slimy, gooey, cartoony ghost Pokémon. Translucent green or purple, dripping, amorphous shape with a simple, menacing face (eyes and mouth). Style: Pokémon-like."
  },
  {
    "number": 67,
    "name": "Aurorabore",
    "category": "Northern Light",
    "type": "Ice/Fairy",
    "height": "5'10\"",
    "weight": "120.8 lbs",
    "numberBattled": 40,
    "description": "Its fur shimmers with the colors of the aurora borealis. Appears only in frigid regions.",
    "3dModelPrompt": "Generate a 3D model of a graceful, cartoony mammal Pokémon (like a deer or fox). White fur that shifts through pastel colors (greens, pinks, blues). Gentle eyes, perhaps small antlers. Style: Pokémon-like."
  },
  {
    "number": 68,
    "name": "Cogwork",
    "category": "Gear",
    "type": "Steel",
    "height": "1'1\"",
    "weight": "50.5 lbs",
    "numberBattled": 75,
    "description": "A small, mechanical Pokémon made of interlocking gears. Always seems busy.",
    "3dModelPrompt": "Generate a 3D model of a small, cartoony Pokémon made of interlocking brass or steel gears. Constantly spinning parts, simple wind-up key on its back, basic eyes. Style: Pokémon-like."
  },
  {
    "number": 69,
    "name": "Umbracat",
    "category": "Shadow Cat",
    "type": "Dark",
    "height": "2'4\"",
    "weight": "29.6 lbs",
    "numberBattled": 83,
    "description": "Can melt into shadows, becoming nearly invisible. Enjoys playing tricks.",
    "3dModelPrompt": "Generate a 3D model of a sleek, black, cartoony cat Pokémon. Large yellow eyes, long tail, mischievous grin. Perhaps parts of it fade into shadow. Style: Pokémon-like."
  },
  {
    "number": 70,
    "name": "Sporead",
    "category": "Fungus",
    "type": "Grass/Poison",
    "height": "3'2\"",
    "weight": "50.1 lbs",
    "numberBattled": 62,
    "description": "Resembles a large mushroom. Releases clouds of spores with various effects.",
    "3dModelPrompt": "Generate a 3D model of a walking, cartoony mushroom Pokémon. Large red cap with white spots, thick beige stem forming the body and legs, simple face on the stem. Style: Pokémon-like."
  },
  {
    "number": 71,
    "name": "Dracofrost",
    "category": "Ice Dragon",
    "type": "Dragon/Ice",
    "height": "8'8\"",
    "weight": "480.2 lbs",
    "numberBattled": 21,
    "description": "A powerful dragon encased in ice armor. Its roar can cause avalanches.",
    "3dModelPrompt": "Generate a 3D model of a large, powerful, cartoony dragon Pokémon. Covered in icy blue scales and ice spikes. Breathes frost. Looks imposing but still Pokémon-style. Style: Pokémon-like."
  },
  {
    "number": 72,
    "name": "Melodia",
    "category": "Melody",
    "type": "Normal/Psychic",
    "height": "2'7\"",
    "weight": "31.0 lbs",
    "numberBattled": 90,
    "description": "Creates soothing melodies using psychic energy. Its songs can heal or induce sleep.",
    "3dModelPrompt": "Generate a 3D model of a cute, cartoony Pokémon perhaps resembling a musical note or instrument. Soft colors, gentle expression, maybe floating musical notes around it. Style: Pokémon-like."
  },
  {
    "number": 73,
    "name": "Brawlvine",
    "category": "Fighting Plant",
    "type": "Grass/Fighting",
    "height": "5'4\"",
    "weight": "165.3 lbs",
    "numberBattled": 42,
    "description": "A plant Pokémon with vine-like arms it uses for grappling and striking.",
    "3dModelPrompt": "Generate a 3D model of a humanoid plant, cartoony Pokémon. Body made of wood/bark, long green vines for arms, leafy 'hair'. Looks tough and ready to fight. Style: Pokémon-like."
  },
  {
    "number": 74,
    "name": "Smolder",
    "category": "Smoke",
    "type": "Fire/Ghost",
    "height": "3'6\"",
    "weight": "1.9 lbs",
    "numberBattled": 72,
    "description": "Appears as a shifting cloud of smoke and embers. Can burn and phase through objects.",
    "3dModelPrompt": "Generate a 3D model of a cartoony Pokémon made of swirling grey smoke with glowing red embers within. Vague shape, perhaps with visible glowing eyes. Style: Pokémon-like."
  },
  {
    "number": 75,
    "name": "Coralife",
    "category": "Coral Reef",
    "type": "Water/Rock",
    "height": "3'0\"",
    "weight": "170.7 lbs",
    "numberBattled": 32,
    "description": "A living piece of coral that provides shelter for small water Pokémon.",
    "3dModelPrompt": "Generate a 3D model of a cartoony Pokémon resembling a colorful piece of coral. Various shapes and colors (pinks, oranges, blues), perhaps with small polyps and simple eyes. Style: Pokémon-like."
  },
  {
    "number": 76,
    "name": "Voltaic",
    "category": "Battery",
    "type": "Electric/Steel",
    "height": "1'10\"",
    "weight": "85.0 lbs",
    "numberBattled": 80,
    "description": "Its metallic body stores vast amounts of electrical energy, like a battery.",
    "3dModelPrompt": "Generate a 3D model of a small, cartoony robot Pokémon resembling a battery. Cylindrical body, positive and negative terminals visible, simple arms and legs, glowing eyes. Style: Pokémon-like."
  },
  {
    "number": 77,
    "name": "Skitter",
    "category": "Tiny Bug",
    "type": "Bug/Normal",
    "height": "0'6\"",
    "weight": "0.9 lbs",
    "numberBattled": 148,
    "description": "An extremely common bug Pokémon found almost everywhere. Moves very quickly.",
    "3dModelPrompt": "Generate a 3D model of a very small, simple, cartoony bug Pokémon. Could resemble a tiny beetle or spider. Basic colors, simple eyes, many small legs. Style: Pokémon-like."
  },
  {
    "number": 78,
    "name": "Galebird",
    "category": "Wind Rider",
    "type": "Flying",
    "height": "4'10\"",
    "weight": "45.8 lbs",
    "numberBattled": 93,
    "description": "Creates powerful gusts of wind with its wings. Often seen flying ahead of storms.",
    "3dModelPrompt": "Generate a 3D model of a sleek, powerful, cartoony bird Pokémon. Aerodynamic shape, perhaps grey and white feathers, sharp beak, determined eyes. Style: Pokémon-like."
  },
  {
    "number": 79,
    "name": "Craggle",
    "category": "Pebble",
    "type": "Rock/Ground",
    "height": "1'4\"",
    "weight": "40.3 lbs",
    "numberBattled": 67,
    "description": "A small, living rock that often gathers in groups, forming larger structures.",
    "3dModelPrompt": "Generate a 3D model of a small, simple, cartoony rock Pokémon. Looks like a walking pebble or small boulder. Brown or grey, very basic limbs and face. Style: Pokémon-like."
  },
  {
    "number": 80,
    "name": "Mysteria",
    "category": "Enigma",
    "type": "Psychic/Fairy",
    "height": "3'3\"",
    "weight": "28.1 lbs",
    "numberBattled": 53,
    "description": "A mysterious Pokémon whose motives and origins are unknown. Radiates a strange energy.",
    "3dModelPrompt": "Generate a 3D model of a mysterious, floating, cartoony Pokémon. Perhaps has a mask or hidden face, flowing robes or energy trails. Colors like purple, silver, teal. Style: Pokémon-like."
  },
  {
    "number": 81,
    "name": "Nighthowl",
    "category": "Lurking",
    "type": "Dark",
    "height": "4'4\"",
    "weight": "98.7 lbs",
    "numberBattled": 74,
    "description": "Its chilling howl echoes in the night. It stalks prey under the cover of darkness.",
    "3dModelPrompt": "Generate a 3D model of a menacing but cartoony wolf or dog-like Pokémon. Black fur, glowing red eyes, sharp teeth, perhaps shadowy wisps coming off it. Style: Pokémon-like."
  },
  {
    "number": 82,
    "name": "Ferrum",
    "category": "Iron Ore",
    "type": "Steel/Rock",
    "height": "2'9\"",
    "weight": "310.5 lbs",
    "numberBattled": 35,
    "description": "Appears to be a chunk of iron ore, but is a living Pokémon. Extremely dense and heavy.",
    "3dModelPrompt": "Generate a 3D model of a cartoony Pokémon that looks like a lump of raw iron ore. Metallic sheen mixed with rock texture, reddish-brown and grey colors. Simple, rugged features. Style: Pokémon-like."
  },
  {
    "number": 83,
    "name": "Sludgepuff",
    "category": "Toxic Cloud",
    "type": "Poison",
    "height": "2'0\"",
    "weight": "10.1 lbs",
    "numberBattled": 65,
    "description": "A floating Pokémon made of noxious gases. Avoid inhaling near it.",
    "3dModelPrompt": "Generate a 3D model of a floating, cartoony cloud Pokémon made of purple and green toxic gas. Puffy shape, simple angry eyes within the cloud. Style: Pokémon-like."
  },
  {
    "number": 84,
    "name": "Dracosaura",
    "category": "Ancient Dragon",
    "type": "Dragon",
    "height": "10'2\"",
    "weight": "550.0 lbs",
    "numberBattled": 11,
    "description": "An ancient dragon type, thought to be extinct. Possesses immense raw power.",
    "3dModelPrompt": "Generate a 3D model of a large, classic, four-legged, cartoony dragon Pokémon. Green or brown scales, large wings, powerful build, horns, long tail. Looks ancient and strong. Style: Pokémon-like."
  },
  {
    "number": 85,
    "name": "Plainsrun",
    "category": "Swift",
    "type": "Normal",
    "height": "4'1\"",
    "weight": "70.3 lbs",
    "numberBattled": 138,
    "description": "Built for speed, it runs across open plains faster than the wind.",
    "3dModelPrompt": "Generate a 3D model of a fast, gazelle or ostrich-like, cartoony Pokémon. Long legs, streamlined body, tan or brown colors. Looks built for running. Style: Pokémon-like."
  },
  {
    "number": 86,
    "name": "Brambleboar",
    "category": "Thorn Pig",
    "type": "Grass/Ground",
    "height": "4'9\"",
    "weight": "400.1 lbs",
    "numberBattled": 36,
    "description": "Its hide is covered in tough bark and sharp brambles instead of fur.",
    "3dModelPrompt": "Generate a 3D model of a large, cartoony boar Pokémon. Body covered in brown bark texture and green thorny brambles. Large tusks, tough appearance. Style: Pokémon-like."
  },
  {
    "number": 87,
    "name": "Scorchet",
    "category": "Tiny Flame",
    "type": "Fire",
    "height": "1'3\"",
    "weight": "8.0 lbs",
    "numberBattled": 98,
    "description": "A small, energetic Pokémon that leaves scorch marks where it runs.",
    "3dModelPrompt": "Generate a 3D model of a small, fast, cartoony mammal Pokémon (like a ferret). Red/orange fur, tail tipped with a small flame, energetic pose. Style: Pokémon-like."
  },
  {
    "number": 88,
    "name": "Dewdrop",
    "category": "Morning Dew",
    "type": "Water/Grass",
    "height": "0'7\"",
    "weight": "1.2 lbs",
    "numberBattled": 112,
    "description": "Resembles a large dewdrop clinging to a leaf. Absorbs sunlight through its leaf.",
    "3dModelPrompt": "Generate a 3D model of a tiny, cute, cartoony Pokémon. Looks like a translucent water droplet sitting on a small green leaf. Simple, happy face on the droplet. Style: Pokémon-like."
  },
  {
    "number": 89,
    "name": "Statiking",
    "category": "Plasma Lord",
    "type": "Electric",
    "height": "5'8\"",
    "weight": "180.5 lbs",
    "numberBattled": 44,
    "description": "Commands powerful electrical storms. Its body crackles with immense energy.",
    "3dModelPrompt": "Generate a 3D model of a powerful, imposing, cartoony humanoid Pokémon made of crackling electricity. Yellow and white energy, perhaps a crown-like shape on its head. Looks regal and electric. Style: Pokémon-like."
  },
  {
    "number": 90,
    "name": "Fluttermist",
    "category": "Illusion Moth",
    "type": "Bug/Psychic",
    "height": "3'1\"",
    "weight": "12.3 lbs",
    "numberBattled": 77,
    "description": "The patterns on its wings create confusing illusions. Often found in misty forests.",
    "3dModelPrompt": "Generate a 3D model of a mystical, cartoony moth Pokémon. Wings have hypnotic, swirling patterns (purples, blues). Body is slender, large antennae, enigmatic eyes. Style: Pokémon-like."
  },
  {
    "number": 91,
    "name": "Skysoar",
    "category": "Jet",
    "type": "Flying/Steel",
    "height": "5'11\"",
    "weight": "260.9 lbs",
    "numberBattled": 39,
    "description": "Its metallic body and powerful wings allow it to fly at supersonic speeds.",
    "3dModelPrompt": "Generate a 3D model of a sleek, jet-plane-like, cartoony bird Pokémon. Metallic silver body, sharp angles, powerful wings/jets. Looks incredibly fast. Style: Pokémon-like."
  },
  {
    "number": 92,
    "name": "Tremorock",
    "category": "Earthquake",
    "type": "Rock/Ground",
    "height": "6'5\"",
    "weight": "850.0 lbs",
    "numberBattled": 23,
    "description": "Striking the ground with its massive fists causes powerful earthquakes.",
    "3dModelPrompt": "Generate a 3D model of a large, gorilla-like, cartoony Pokémon made of rock and earth. Huge fists, powerful build, brown and grey colors. Looks immensely strong. Style: Pokémon-like."
  },
  {
    "number": 93,
    "name": "Wraithvine",
    "category": "Ghost Plant",
    "type": "Ghost/Grass",
    "height": "4'7\"",
    "weight": "22.8 lbs",
    "numberBattled": 55,
    "description": "A parasitic plant infused with ghostly energy. Drains life force from other plants.",
    "3dModelPrompt": "Generate a 3D model of a spooky, cartoony plant Pokémon. Dark, wilted leaves and thorny vines, perhaps with a ghostly aura or face. Colors are dark greens, purples, greys. Style: Pokémon-like."
  },
  {
    "number": 94,
    "name": "Glacierus",
    "category": "Iceberg",
    "type": "Ice/Water",
    "height": "7'0\"",
    "weight": "900.5 lbs",
    "numberBattled": 20,
    "description": "Resembles a small iceberg. Moves slowly but is immensely powerful and cold.",
    "3dModelPrompt": "Generate a 3D model of a large, slow, cartoony Pokémon resembling an iceberg. Jagged white and blue ice form, perhaps with simple eyes. Looks massive and cold. Style: Pokémon-like."
  },
  {
    "number": 95,
    "name": "Mirefang",
    "category": "Swamp Beast",
    "type": "Poison/Dark",
    "height": "5'1\"",
    "weight": "175.4 lbs",
    "numberBattled": 47,
    "description": "Lurks in polluted swamps. Its bite injects a potent toxin and shadowy energy.",
    "3dModelPrompt": "Generate a 3D model of a monstrous, amphibious, cartoony Pokémon. Dark, muddy colors (brown, green, black), sharp fangs, glowing eyes, perhaps covered in sludge. Style: Pokémon-like."
  },
  {
    "number": 96,
    "name": "Titania",
    "category": "Fairy Queen",
    "type": "Fairy/Psychic",
    "height": "5'6\"",
    "weight": "110.2 lbs",
    "numberBattled": 27,
    "description": "A regal and powerful fairy Pokémon, said to rule over a hidden fairy kingdom.",
    "3dModelPrompt": "Generate a 3D model of a regal, humanoid, cartoony fairy Pokémon. Elegant design, flowing dress-like features, butterfly wings, perhaps a small crown. Radiant and powerful aura. Style: Pokémon-like."
  },
  {
    "number": 97,
    "name": "Annihilaze",
    "category": "Destruction",
    "type": "Fire/Dragon",
    "height": "11'0\"",
    "weight": "620.8 lbs",
    "numberBattled": 9,
    "description": "A fearsome dragon whose breath can incinerate anything. Leaves destruction in its wake.",
    "3dModelPrompt": "Generate a 3D model of a large, fearsome, cartoony dragon Pokémon. Black and red scales, fiery breath visible, sharp claws and horns, menacing expression. Style: Pokémon-like, but intimidating."
  },
  {
    "number": 98,
    "name": "Constructo",
    "category": "Builder",
    "type": "Steel/Ground",
    "height": "6'2\"",
    "weight": "500.0 lbs",
    "numberBattled": 24,
    "description": "Uses materials like rock and metal to build structures or modify its own body.",
    "3dModelPrompt": "Generate a 3D model of a bulky, robot-like, cartoony Pokémon. Looks like a construction vehicle (e.g., bulldozer or crane) combined with a golem. Yellow and grey colors. Style: Pokémon-like."
  },
  {
    "number": 99,
    "name": "Serenymph",
    "category": "Calm Water",
    "type": "Water/Fairy",
    "height": "4'0\"",
    "weight": "65.3 lbs",
    "numberBattled": 66,
    "description": "Lives in pristine lakes. Its presence purifies water and calms agitated minds.",
    "3dModelPrompt": "Generate a 3D model of a graceful, serene, cartoony water spirit Pokémon. Flowing blue and white form, perhaps resembling a nymph or mermaid. Gentle expression, possibly holding a pearl. Style: Pokémon-like."
  },
  {
    "number": 100,
    "name": "Genesis",
    "category": "Origin",
    "type": "Normal",
    "height": "1'0\"",
    "weight": "10.0 lbs",
    "numberBattled": 1,
    "description": "A mythical Pokémon said to hold the genetic code of many other Pokémon. Extremely rare.",
    "3dModelPrompt": "Generate a 3D model of a small, simple, yet mystical cartoony Pokémon. Perhaps egg-shaped or resembling a seed, glowing with a soft white or rainbow light. Looks ancient and fundamental. Style: Pokémon-like."
  }
]